# Задача 4. Вариант 24.
name = 'Демьян Бедный'
interests = 'филология, литература, стихотворчечство'
bdate = 1883
ddate = 1945
age = ddate - bdate
print('Ефи́м Алексе́евич Придво́ров, также известен под именем', name)
print('Род интересов:', interests)
print('Родился в', bdate, 'году')
print('Умер в', ddate, 'году, в возрасте', age, 'лет')
input('Press Enter to exit')

#Smiyanov D. A.
#06.09.2018
